wrk/wrkTestGet
wrk -t4 -c8 -d30s -R10000 -s ./wrk/get.lua --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 8 connections
  Thread calibration: mean lat.: 14.383ms, rate sampling interval: 76ms
  Thread calibration: mean lat.: 25.085ms, rate sampling interval: 299ms
  Thread calibration: mean lat.: 25.517ms, rate sampling interval: 296ms
  Thread calibration: mean lat.: 14.792ms, rate sampling interval: 101ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  721.38us  13.69ms   81.48%
    Req/Sec     2.51k    26.17     2.72k    83.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    1.44ms
 90.000%    1.82ms
 99.000%    4.10ms
 99.900%    7.42ms
 99.990%   11.05ms
 99.999%   13.32ms
100.000%   13.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.078     0.000000            1         1.00
       0.424     0.100000        20056         1.11
       0.645     0.200000        40024         1.25
       0.794     0.300000        59989         1.43
       0.934     0.400000        80069         1.67
       1.070     0.500000       100001         2.00
       1.136     0.550000       110049         2.22
       1.198     0.600000       119994         2.50
       1.268     0.650000       130032         2.86
       1.345     0.700000       139979         3.33
       1.436     0.750000       149974         4.00
       1.489     0.775000       154936         4.44
       1.544     0.800000       159917         5.00
       1.602     0.825000       164948         5.71
       1.664     0.850000       169924         6.67
       1.737     0.875000       174916         8.00
       1.775     0.887500       177404         8.89
       1.815     0.900000       179896        10.00
       1.859     0.912500       182416        11.43
       1.910     0.925000       184916        13.33
       1.969     0.937500       187405        16.00
       2.005     0.943750       188637        17.78
       2.049     0.950000       189905        20.00
       2.101     0.956250       191165        22.86
       2.175     0.962500       192384        26.67
       2.287     0.968750       193628        32.00
       2.373     0.971875       194257        35.56
       2.505     0.975000       194883        40.00
       2.711     0.978125       195505        45.71
       2.995     0.981250       196130        53.33
       3.347     0.984375       196753        64.00
       3.533     0.985938       197069        71.11
       3.735     0.987500       197376        80.00
       3.955     0.989062       197688        91.43
       4.195     0.990625       198002       106.67
       4.483     0.992188       198315       128.00
       4.631     0.992969       198469       142.22
       4.831     0.993750       198629       160.00
       5.031     0.994531       198781       182.86
       5.307     0.995313       198942       213.33
       5.607     0.996094       199095       256.00
       5.747     0.996484       199172       284.44
       5.931     0.996875       199252       320.00
       6.115     0.997266       199329       365.71
       6.315     0.997656       199406       426.67
       6.571     0.998047       199484       512.00
       6.703     0.998242       199523       568.89
       6.855     0.998437       199566       640.00
       7.023     0.998633       199601       731.43
       7.223     0.998828       199640       853.33
       7.475     0.999023       199679      1024.00
       7.611     0.999121       199699      1137.78
       7.775     0.999219       199719      1280.00
       7.863     0.999316       199738      1462.86
       8.035     0.999414       199757      1706.67
       8.303     0.999512       199777      2048.00
       8.431     0.999561       199787      2275.56
       8.519     0.999609       199796      2560.00
       8.679     0.999658       199808      2925.71
       8.831     0.999707       199816      3413.33
       9.191     0.999756       199826      4096.00
       9.359     0.999780       199831      4551.11
       9.607     0.999805       199835      5120.00
       9.919     0.999829       199840      5851.43
      10.223     0.999854       199845      6826.67
      10.727     0.999878       199850      8192.00
      10.959     0.999890       199853      9102.22
      11.207     0.999902       199855     10240.00
      11.375     0.999915       199857     11702.86
      11.847     0.999927       199860     13653.33
      11.975     0.999939       199862     16384.00
      12.223     0.999945       199864     18204.44
      12.295     0.999951       199865     20480.00
      12.391     0.999957       199866     23405.71
      12.463     0.999963       199867     27306.67
      12.639     0.999969       199868     32768.00
      12.727     0.999973       199869     36408.89
      13.023     0.999976       199870     40960.00
      13.023     0.999979       199870     46811.43
      13.055     0.999982       199871     54613.33
      13.055     0.999985       199871     65536.00
      13.319     0.999986       199872     72817.78
      13.319     0.999988       199872     81920.00
      13.319     0.999989       199872     93622.86
      13.503     0.999991       199873    109226.67
      13.503     0.999992       199873    131072.00
      13.503     0.999993       199873    145635.56
      13.503     0.999994       199873    163840.00
      13.503     0.999995       199873    187245.71
      13.695     0.999995       199874    218453.33
      13.695     1.000000       199874          inf
#[Mean    =        1.148, StdDeviation   =        0.721]
#[Max     =       13.688, Total count    =       199874]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299938 requests in 30.00s, 20.80MB read
Requests/sec:   9998.40
Transfer/sec:    710.03KB