wrk/wrkTestPut
wrk -t4 -c8 -d180s -R10000 -s ./wrk/put.lua --latency http://localhost:8080
Running 3m test @ http://localhost:8080
  4 threads and 8 connections
  Thread calibration: mean lat.: 1.726ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.757ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.722ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.718ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms    7.07ms 183.81ms   99.48%
    Req/Sec     2.64k   233.39     6.55k    79.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.00ms
 75.000%    1.34ms
 90.000%    1.66ms
 99.000%    3.85ms
 99.900%  139.26ms
 99.990%  178.82ms
 99.999%  182.91ms
100.000%  183.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            3         1.00
       0.359     0.100000       170150         1.11
       0.585     0.200000       340052         1.25
       0.728     0.300000       510243         1.43
       0.863     0.400000       680809         1.67
       1.003     0.500000       850119         2.00
       1.062     0.550000       935738         2.22
       1.114     0.600000      1020207         2.50
       1.167     0.650000      1105189         2.86
       1.241     0.700000      1190871         3.33
       1.340     0.750000      1275119         4.00
       1.395     0.775000      1317774         4.44
       1.446     0.800000      1360028         5.00
       1.494     0.825000      1402960         5.71
       1.541     0.850000      1445293         6.67
       1.596     0.875000      1487671         8.00
       1.628     0.887500      1508701         8.89
       1.664     0.900000      1530185        10.00
       1.700     0.912500      1551376        11.43
       1.736     0.925000      1572576        13.33
       1.774     0.937500      1593721        16.00
       1.796     0.943750      1604489        17.78
       1.820     0.950000      1615168        20.00
       1.849     0.956250      1625726        22.86
       1.885     0.962500      1636172        26.67
       1.936     0.968750      1646775        32.00
       1.975     0.971875      1652153        35.56
       2.030     0.975000      1657418        40.00
       2.119     0.978125      1662748        45.71
       2.283     0.981250      1668044        53.33
       2.601     0.984375      1673336        64.00
       2.835     0.985938      1675990        71.11
       3.155     0.987500      1678647        80.00
       3.563     0.989062      1681312        91.43
       4.079     0.990625      1683966       106.67
       4.843     0.992188      1686612       128.00
       5.419     0.992969      1687942       142.22
       6.243     0.993750      1689269       160.00
       7.659     0.994531      1690597       182.86
      11.687     0.995313      1691925       213.33
      24.223     0.996094      1693252       256.00
      37.855     0.996484      1693916       284.44
      45.695     0.996875      1694581       320.00
      60.223     0.997266      1695245       365.71
      85.951     0.997656      1695911       426.67
     108.607     0.998047      1696573       512.00
     117.567     0.998242      1696906       568.89
     125.119     0.998437      1697236       640.00
     129.407     0.998633      1697568       731.43
     133.247     0.998828      1697910       853.33
     140.159     0.999023      1698234      1024.00
     143.743     0.999121      1698398      1137.78
     150.655     0.999219      1698565      1280.00
     157.951     0.999316      1698733      1462.86
     164.223     0.999414      1698896      1706.67
     170.111     0.999512      1699069      2048.00
     172.031     0.999561      1699146      2275.56
     173.567     0.999609      1699229      2560.00
     174.719     0.999658      1699321      2925.71
     175.743     0.999707      1699399      3413.33
     176.383     0.999756      1699491      4096.00
     176.639     0.999780      1699529      4551.11
     177.151     0.999805      1699564      5120.00
     177.663     0.999829      1699616      5851.43
     177.919     0.999854      1699652      6826.67
     178.303     0.999878      1699686      8192.00
     178.559     0.999890      1699712      9102.22
     178.943     0.999902      1699734     10240.00
     179.327     0.999915      1699758     11702.86
     179.583     0.999927      1699770     13653.33
     180.095     0.999939      1699792     16384.00
     180.479     0.999945      1699808     18204.44
     180.607     0.999951      1699812     20480.00
     181.119     0.999957      1699820     23405.71
     181.503     0.999963      1699834     27306.67
     182.271     0.999969      1699843     32768.00
     182.399     0.999973      1699852     36408.89
     182.399     0.999976      1699852     40960.00
     182.527     0.999979      1699856     46811.43
     182.655     0.999982      1699864     54613.33
     182.783     0.999985      1699874     65536.00
     182.783     0.999986      1699874     72817.78
     182.783     0.999988      1699874     81920.00
     182.783     0.999989      1699874     93622.86
     182.911     0.999991      1699877    109226.67
     183.039     0.999992      1699881    131072.00
     183.039     0.999993      1699881    145635.56
     183.167     0.999994      1699884    163840.00
     183.167     0.999995      1699884    187245.71
     183.295     0.999995      1699887    218453.33
     183.295     0.999996      1699887    262144.00
     183.295     0.999997      1699887    291271.11
     183.295     0.999997      1699887    327680.00
     183.423     0.999997      1699888    374491.43
     183.551     0.999998      1699890    436906.67
     183.551     0.999998      1699890    524288.00
     183.551     0.999998      1699890    582542.22
     183.551     0.999998      1699890    655360.00
     183.551     0.999999      1699890    748982.86
     183.807     0.999999      1699891    873813.33
     183.807     0.999999      1699891   1048576.00
     183.807     0.999999      1699891   1165084.44
     183.807     0.999999      1699891   1310720.00
     183.807     0.999999      1699891   1497965.71
     183.935     0.999999      1699892   1747626.67
     183.935     1.000000      1699892          inf
#[Mean    =        1.438, StdDeviation   =        7.073]
#[Max     =      183.808, Total count    =      1699892]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1799964 requests in 3.00m, 115.01MB read
Requests/sec:   9999.81
Transfer/sec:    654.28KB